n5/src/Catalogs/Organizations/Organizations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Organizations</name>
  <basedOn>Catalog.Leads</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Address</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>Alien</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Birthday</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Birthplace</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>Chain</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>CodeFiscal</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Contact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerContract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerType</name>
    <type>
      <types>EnumRef.CustomerTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Fax</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Government</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GroupsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IssuedBy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ItemsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Lead</name>
    <type>
      <types>CatalogRef.Leads</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ObjectUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentContact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Phone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Policy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Salesman</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShippingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>ShippingContact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>SIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>CatalogRef.TaxGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidTo</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorContract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Web</name>
    <type>
      <types>DefinedType.Web</types>
    </type>
  </attributes>
  <attributes>
    <name>Wholesaler</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ApprovalList</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>Priority</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Properties</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Properties</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.Properties</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/Enums/CustomerTypes/CustomerTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CustomerTypes</name>
  <enumValues>
    <name>Wholesaler</name>
  </enumValues>
  <enumValues>
    <name>Branch</name>
  </enumValues>
  <enumValues>
    <name>Chain</name>
  </enumValues>
  <enumValues>
    <name>ChainRetailer</name>
  </enumValues>
  <enumValues>
    <name>IndependentWholesaler</name>
  </enumValues>
  <enumValues>
    <name>Dispensary</name>
  </enumValues>
  <enumValues>
    <name>IndependentRetailer</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
</mdclass:Enum>

n5/src/Enums/PropertiesUsage/PropertiesUsage.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PropertiesUsage</name>
  <enumValues>
    <name>Inherit</name>
  </enumValues>
  <enumValues>
    <name>Special</name>
  </enumValues>
  <enumValues>
    <name>None</name>
  </enumValues>
</mdclass:Enum>

n5/src/Enums/PropertiesScope/PropertiesScope.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PropertiesScope</name>
  <enumValues>
    <name>Item</name>
  </enumValues>
  <enumValues>
    <name>Groups</name>
  </enumValues>
  <enumValues>
    <name>Items</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/Contacts/Contacts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Contacts</name>
  <basedOn>Catalog.Leads</basedOn>
  <owners>Catalog.Companies</owners>
  <owners>Catalog.Organizations</owners>
  <owners>Catalog.Warehouses</owners>
  <owners>Catalog.Leads</owners>
  <attributes>
    <name>AdditionalPhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Birthday</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessPhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Contact</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactType</name>
    <type>
      <types>CatalogRef.ContactTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Fax</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>HomePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Lead</name>
    <type>
      <types>CatalogRef.Leads</types>
    </type>
  </attributes>
  <attributes>
    <name>MobilePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Salutation</name>
    <type>
      <types>CatalogRef.Salutations</types>
    </type>
  </attributes>
  <attributes>
    <name>Skype</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Twitter</name>
    <type>
      <types>DefinedType.Twitter</types>
    </type>
  </attributes>
  <attributes>
    <name>Web</name>
    <type>
      <types>DefinedType.Web</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Catalogs/Addresses/Addresses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Addresses</name>
  <owners>Catalog.Companies</owners>
  <owners>Catalog.Organizations</owners>
  <owners>Catalog.Warehouses</owners>
  <owners>Catalog.Banks</owners>
  <owners>Catalog.Individuals</owners>
  <owners>Catalog.Contacts</owners>
  <attributes>
    <name>Address</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Apartment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Building</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>City</name>
    <type>
      <types>CatalogRef.Cities</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.Countries</types>
    </type>
  </attributes>
  <attributes>
    <name>Entrance</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Floor</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Manual</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Municipality</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>State</name>
    <type>
      <types>CatalogRef.States</types>
    </type>
  </attributes>
  <attributes>
    <name>Street</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZIP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZIPFormat</name>
    <type>
      <types>EnumRef.ZIP</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Catalogs/Organizations/Forms/Form/Module.bsl
&AtServer
var Base;

// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Options.ApplyOrganization ( ThisObject, Object.Ref );
	filterByVendor ();
	initPhones ();
	updateWarning ( ThisObject );
	OptionalProperties.Load ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure filterByVendor ()
	
	if ( not Object.Vendor ) then
		return;
	endif; 
	DC.ChangeFilter ( VendorItems, "Vendor", Object.Ref, true );
	
EndProcedure
 
&AtServer
Procedure initPhones ()
	
	PhoneTemplates.Set ( ThisObject, "Phone, Fax" );

EndProcedure 

&AtClientAtServerNoContext
Procedure updateWarning ( Form )
	
	object = Form.Object;
	code = object.CodeFiscal;
	if ( code = "" ) then
		Form.WrongCode = false;		
	else
		Form.WrongCode = codeExists ( code, object.Ref );		
	endif;
	Appearance.Apply ( Form, "WrongCode" );
	
EndProcedure

&AtServerNoContext
Function codeExists ( val Code, val Ref )
	
	s = "
	|select top 1 1
	|from Catalog.Organizations as Organizations
	|where Organizations.CodeFiscal = &Code
	|and Organizations.Ref <> &Ref
	|and not Organizations.DeletionMark";
	q = new Query ( s );
	q.SetParameter ( "Code", Code );
	q.SetParameter ( "Ref", Ref );
	SetPrivilegedMode ( true );
	return not q.Execute ().IsEmpty ();
	
EndFunction

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	init ();
	if ( Object.Ref.IsEmpty () ) then
		Options.Organization ( ThisObject, Object.Ref );
		OptionalProperties.Load ( ThisObject );
		initPhones ();
		filterByVendor ();
		if ( Parameters.Basis = undefined ) then
			fillNew ();
		else
			Base = Parameters.Basis;
			type = TypeOf ( Base );
			if ( type = Type ( "CatalogRef.Leads" ) ) then
				fillByLead ();
			endif;
		endif;
		updateWarning ( ThisObject );
		setRegistrationDate ();
	endif; 
	lockDescription ();
	OptionalProperties.Access ( ThisObject );
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure init ()
	
	UseAI = Application.AI ();
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Lead show filled ( Object.Lead );
	|VendorPage show Object.Vendor;
	|CustomerPage show Object.Customer;
	|Write Write1 show empty ( Object.Ref );
	|CustomerContract VendorContract VendorItems enable filled ( Object.Ref );
	|PaymentAddress ShippingAddress show filled ( Object.Ref );
	|AddressInfo show empty ( Object.Ref );
	|Address Birthplace show Object.Individual and filled ( Object.Ref );
	|Wholesaler show Object.CustomerType = Enum.CustomerTypes.Branch;
	|Chain show Object.CustomerType = Enum.CustomerTypes.ChainRetailer;
	|FormDocumentSalesOrderNew FormDocumentInvoiceNew FormDocumentIOSheetNew show Object.Customer;
	|FormDocumentPurchaseOrderNew FormDocumentVendorInvoiceNew show Object.Vendor;
	|Description lock PropertiesData.ChangeName;
	|FullDescription lock PropertiesData.ChangeDescription;
	|OpenObjectUsage enable inlist ( Object.ObjectUsage, Enum.PropertiesUsage.Inherit, Enum.PropertiesUsage.Special );
	|ContactPerson PaymentContact ShippingContact hide Object.Individual or empty ( Object.Ref );
	|EntityGroup Government hide Object.Individual;
	|IndividualGroup1 IndividualGroup2 IndividualGroup3 show Object.Individual;
	|VATCode show Object.VATUse > 0;
	|WrongCode show WrongCode;
	|Fill hide Object.Individual;
	|Individual hide Object.Government;
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( Parameters.FillingText = "" ) then
		company = Parameters.Company;
		if ( not company.IsEmpty () ) then
			Object.Description = company.Description;
			Object.FullDescription = company.FullDescription;
			Object.CodeFiscal = company.CodeFiscal;
			if ( company.VAT ) then
				Object.VATUse = 1;
			endif;
		endif;
	else
		Object.Description = "";
	endif; 
	if ( not Parameters.CopyingValue.IsEmpty () ) then
		Object.Contact = undefined;
		Object.Address = undefined;
		Object.Birthplace = undefined;
		Object.CustomerContract = undefined;
		Object.VendorContract = undefined;
		Object.PaymentAddress = undefined;
		Object.PaymentContact = undefined;
		Object.ShippingAddress = undefined;
		Object.ShippingContact = undefined;
	endif; 
	
EndProcedure 

&AtServer
Procedure fillByLead ()
	
	data = leadData ();
	Object.Customer = true;
	Object.Lead = Base;
	Object.Phone = data.BusinessPhone;
	Object.Email = data.Email;
	Object.Fax = data.Fax;
	Object.Web = data.Web;
	UploadLead = true;
	fillName ( data.OrganizationName );
	
EndProcedure

&AtServer
Function leadData ()
	
	data = DF.Values ( Base, "OrganizationName, BusinessPhone, Email, Fax, Web" );
	return data;
	
EndFunction

&AtServer
Procedure setRegistrationDate ()

	Object.RegistrationDate = CurrentSessionDate ();

EndProcedure

&AtServer
Procedure lockDescription ()
	
	if ( Application.AI () ) then
		Items.Description.WarningOnEditRepresentation = WarningOnEditRepresentation.Show;
	endif;
	
EndProcedure

&AtServer
Procedure FillCheckProcessingAtServer ( Cancel, CheckedAttributes )
	
	if ( not OptionalProperties.Check ( ThisObject ) ) then
		Cancel = true;
	endif; 
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	ref = getReference ( CurrentObject );
	if ( Object.Ref.IsEmpty () ) then
		OrganizationsForm.CreateContract ( CurrentObject, ref );
		saveAddress ( CurrentObject, ref );
	endif;
	
EndProcedure

&AtServer
Function getReference ( CurrentObject )
	
	if ( CurrentObject.IsNew () ) then
		CurrentObject.SetNewObjectRef ( Catalogs.Organizations.GetRef ( new UUID () ) );
		return CurrentObject.GetNewObjectRef ();
	else
		return CurrentObject.Ref;
	endif;
	
EndFunction

&AtServer
Procedure saveAddress ( CurrentObject, Ref )
	
	if ( IsBlankString ( AddressInfo.Description ) ) then
		return;
	endif;
	address = FormAttributeToValue ( "AddressInfo" );
	address.Owner = Ref;
	address.DataExchange.Load = true;
	address.Write ();
	addressRef = address.Ref;
	CurrentObject.PaymentAddress = addressRef;
	CurrentObject.ShippingAddress = addressRef;	
	
EndProcedure

&AtServer
Procedure OnWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	if ( UploadLead ) then
		uploadLead ( CurrentObject.Ref );
	else
		inheritAddresses ( CurrentObject );
	endif;
	
EndProcedure

&AtServer
Procedure uploadLead ( Ref )
	
	contacts = Catalogs.Contacts.Select ( , Object.Lead );
	while ( contacts.Next () ) do
		obj = contacts.GetObject ();
		newObj = obj.Copy ();
		newObj.Owner = Ref;
		newObj.Write ();
		newContact = newObj.Ref;
		addresses = Catalogs.Addresses.Select ( , contacts.Ref );
		while ( addresses.Next () ) do
			obj = addresses.GetObject ();
			newObj = obj.Copy ();
			newObj.Owner = Ref;
			newObj.Write ();
			newObj = obj.Copy ();
			newObj.Owner = newContact;
			newObj.Write ();
		enddo;
	enddo;
	UploadLead = false;
	
EndProcedure

&AtServer
Procedure inheritAddresses ( CurrentObject )
	
	company = Parameters.Company;
	inherit = not company.IsEmpty () and Object.Ref.IsEmpty ();
	if ( not inherit ) then
		return;
	endif; 
	paymentAddress = company.PaymentAddress;
	CurrentObject.PaymentAddress = cloneAddress ( paymentAddress, CurrentObject );
	shippingAddress = company.ShippingAddress;
	if ( shippingAddress = paymentAddress ) then
		CurrentObject.ShippingAddress = CurrentObject.PaymentAddress;
	else
		CurrentObject.ShippingAddress = cloneAddress ( shippingAddress, CurrentObject );
	endif; 
	
EndProcedure 

&AtServer
Function cloneAddress ( Address, CurrentObject )
	
	if ( address.IsEmpty () ) then
		return undefined;
	endif; 
	obj = address.Copy ();
	obj.Owner = CurrentObject.Ref;
	obj.Write ();
	return obj.Ref;
	
EndFunction 

&AtServer
Procedure AfterWriteAtServer ( CurrentObject, WriteParameters )
	
	filterByVendor ();
	Options.ApplyOrganization ( ThisObject, Object.Ref );
	Appearance.Apply ( ThisObject );

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure CodeFiscalStartChoice ( Item, ChoiceData, ChoiceByAdding, StandardProcessing )
	
	StandardProcessing = false;
	OpenForm ( "Catalog.OrganizationsClassifier.ChoiceForm", , Item );
	
EndProcedure

&AtClient
Procedure CodeFiscalAutoComplete ( Item, Text, ChoiceData, DataGetParameters, Wait, StandardProcessing )
	
	if ( Object.Individual or StrLen ( Text ) < 3 ) then
		return;
	endif;
	StandardProcessing = false;
	ChoiceData = findOrganizations ( Text );
	
EndProcedure

&AtServerNoContext
Function findOrganizations ( val Text )
	
	return Catalogs.OrganizationsClassifier.GetChoiceData (
		new Structure ( "SearchString", Text )
	);
	
EndFunction

&AtClient
Procedure CodeFiscalChoiceProcessing ( Item, SelectedValue, AdditionalData, ChoiceByAdding, StandardProcessing )

	StandardProcessing = false;
	WaitForm.Open ( "startFillingByClassifier", SelectedValue, ThisObject );
	
EndProcedure

&AtClient
Procedure startFillingByClassifier ( Params, SelectedValue ) export

	fillByClassifier ( SelectedValue );
	WaitForm.Close ();	

EndProcedure

&AtServer
Procedure fillByClassifier ( val Classifier )
	
	applyClassifier ( Classifier );
	updateWarning ( ThisObject );
	Modified = true;
	
EndProcedure

&AtServer
Procedure applyClassifier ( Classifier )

	if ( Object.Individual ) then
		Object.Individual = false;
		applyIndividual ();
	endif;
	fields = DF.Values ( Classifier, "Code, Description, Address" );
	Object.CodeFiscal = fields.Code;
	if ( Object.Ref.IsEmpty () ) then
		fillAddress ( fields.Address );
	endif;
	fillName ( fields.Description );

EndProcedure

&AtServer
Procedure fillAddress ( String )
	
	if ( IsBlankString ( String ) ) then
		return;
	endif;
	disableAI = Left ( String, 1 ) = "#";
	if ( not disableAI and Application.AI () ) then
		FillPropertyValues ( AddressInfo, DataProcessors.AddressInfo.Get ( String ) );
	else
		AddressInfo.Description = ? ( disableAI, TrimAll ( Mid ( String, 2 ) ), String );
		AddressInfo.Manual = true;
	endif;

EndProcedure

&AtServer
Procedure fillName ( val String )
	
	if ( Left ( String, 1 ) = "#" ) then
		Object.FullDescription = TrimAll ( Mid ( String, 2 ) );
		if ( Object.Description = "" ) then
			Object.Description = Object.FullDescription;
		endif;
		return;
	endif;
	if ( Application.AI () ) then
		String = CoreLibrary.CyrillicToRomanian ( String );
		result = buildName ( String );
		Object.Description = Collections.Value ( result, "short_name" );
		Object.FullDescription = Collections.Value ( result, "full_name" );
	else
		Object.Description = String;
		Object.FullDescription = String;
	endif;
	Object.Description =
		CoreLibrary.RomanianToLatin ( TrimAll ( Object.Description ) );
	Object.FullDescription =
		CoreLibrary.RomanianToLatin ( TrimAll ( Object.FullDescription ) );

EndProcedure

&AtServer
Function buildName ( FullName )
	
	result = AI.BuildOrganizationName ( FullName );
	if ( result = undefined ) then
		return undefined;
	endif;
	name = Collections.Value ( result, "short_name", "" );
	if ( name = "" ) then
		return undefined;
	endif;
	if ( duplicate ( name ) ) then
		result.short_name = buildUnique ( name, FullName );
	endif;
	return result;
	
EndFunction

&AtServer
Function duplicate ( Name )
	
	found = Catalogs.Organizations.FindByDescription ( Name, true );
	return not found.IsEmpty () and found <> Object.Ref;

EndFunction

&AtServer
Function buildUnique ( ShortName, FullName )
	
	if ( Object.Individual ) then
		newName = ShortName + Output.IndividualSuffix ();
		if ( not duplicate ( newName ) ) then
			return newName;
		endif;
	endif;
	address = ? ( Object.Ref.IsEmpty (), AddressInfo, Object.PaymentAddress );
	parts = new Array ();
	parts.Add ( address.Country );
	parts.Add ( address.State );
	parts.Add ( address.City );
	parts.Add ( address.Street );
	parts.Add ( address.Number );
	name = new Array ();
	name.Add ( ShortName );
	for each part in parts do
		s = String ( part );
		if ( IsBlankString ( s ) ) then
			continue;
		endif;
		name.Add ( s );
		candidate = StrConcat ( name, ", " );
		if ( not duplicate ( candidate ) ) then
			return candidate;
		endif;
	enddo;
	result = AI.BuildOrganizationName ( FullName, true );
	newName = Collections.Value ( result, "short_name", "" );
	return ? ( newName = "", ShortName, newName );

EndFunction

&AtClient
Procedure CodeFiscalOpening ( Item, StandardProcessing )
	
	StandardProcessing = false;
	OpenForm ( "Catalog.OrganizationsClassifier.ListForm",
		new Structure ( "CurrentRow", findOrganization ( Object.CodeFiscal ) ), ThisForm );
	
EndProcedure

&AtServerNoContext
Function findOrganization ( val Code )
	
	ref = Catalogs.OrganizationsClassifier.FindByCode ( Code );
	if ( ref.IsEmpty () ) then
		raise Output.OrganizationIsNotFound ();
	endif;
	return ref;
	
EndFunction

&AtClient
Procedure CodeFiscalOnChange ( Item )
	
	updateWarning ( ThisObject );
	
EndProcedure

&AtClient
Procedure AddressInfoOnChange ( Item )
	
	address = AddressInfo.Description;
	if ( not IsBlankString ( address ) ) then
		fillAddress ( address );
	endif;
	
EndProcedure

&AtClient
Procedure FullDescriptionOnChange ( Item )
	
	fillName ( Object.FullDescription );
	
EndProcedure

&AtClient
Procedure ParentOnChange ( Item )
	
	applyParent ();
	
EndProcedure

&AtServer
Procedure applyParent ()
	
	OptionalProperties.Load ( ThisObject );
	
EndProcedure 

&AtClient
Procedure PaymentAddressOnChange ( Item )
	
	setShippingAddress ();
	
EndProcedure

&AtClient
Procedure setShippingAddress ()
	
	address = Object.PaymentAddress;
	if ( address.IsEmpty () ) then
		return;
	endif; 
	if ( Object.ShippingAddress.IsEmpty () ) then
		Object.ShippingAddress = address;
	endif; 

EndProcedure 

&AtClient
Procedure ContactPersonOnChange ( Item )
	
	applyContact ();
	
EndProcedure

&AtClient
Procedure applyContact ()
	
	if ( Object.Contact.IsEmpty () ) then
		return;
	endif; 
	if ( Object.PaymentContact.IsEmpty () ) then
		Object.PaymentContact = Object.Contact;
	endif; 
	if ( Object.ShippingContact.IsEmpty () ) then
		Object.ShippingContact = Object.Contact;
	endif; 
	
EndProcedure 

&AtClient
Procedure PaymentContactOnChange ( Item )
	
	setShippingContact ();
	
EndProcedure

&AtClient
Procedure setShippingContact ()
	
	if ( Object.ShippingContact.IsEmpty () ) then
		Object.ShippingContact = Object.PaymentContact;
	endif; 
	
EndProcedure 

&AtClient
Procedure CustomerOnChange ( Item )
	
	Appearance.Apply ( ThisObject, "Object.Customer" );
	
EndProcedure

&AtClient
Procedure VendorOnChange ( Item )
	
	applyVendor ();
	
EndProcedure

&AtServer
Procedure applyVendor ()
	
	filterByVendor ();
	Appearance.Apply ( ThisObject, "Object.Vendor" );	
	
EndProcedure 

&AtClient
Procedure GovernmentOnChange ( Item )
	
	Appearance.Apply ( ThisObject, "Object.Government" );

EndProcedure

&AtClient
Procedure IndividualOnChange ( Item )
	
	applyIndividual ();	
	
EndProcedure

&AtServer
Procedure applyIndividual ()
	
	if ( Object.Individual ) then
		Object.Description = "";
		Object.FullDescription = "";
	else
		Object.FirstName = "";
		Object.LastName = "";
		Object.Patronymic = "";
		Object.Birthday = undefined;
		Object.Gender = undefined;
		Object.Issued = undefined;
		Object.IssuedBy = "";
		Object.SIN = "";
		Object.Policy = "";
		Object.Birthplace = undefined;
		Object.Series = "";
		Object.Number = "";
		Object.ValidTo = undefined;
	endif; 
	Appearance.Apply ( ThisObject, "Object.Individual" );	
	
EndProcedure

&AtClient
Procedure VATUseOnChange ( Item )

	applyVAT ();
	
EndProcedure

&AtClient
Procedure applyVAT ()
	
	if ( Object.VATUse = 0 ) then
		Object.VATCode = "";
	endif;
	Appearance.Apply ( ThisObject, "Object.VATUse" );	

EndProcedure

&AtClient
Procedure CustomerTypeOnChange ( Item )
	
	applyCustomerType ();
	
EndProcedure

&AtServer
Procedure applyCustomerType ()
	
	if ( Object.CustomerType <> Enums.CustomerTypes.Branch ) then
		Object.Wholesaler = undefined;
	endif;
	if ( Object.CustomerType <> Enums.CustomerTypes.ChainRetailer ) then
		Object.Chain = undefined;
	endif; 
	Appearance.Apply ( ThisObject, "Object.CustomerType" );
	
EndProcedure 

&AtClient
Procedure PhoneStartChoice ( Item, ChoiceData, StandardProcessing )
	
	PhoneTemplates.Choice ( ThisObject, Item );

EndProcedure

&AtClient
Procedure NameOnChange ( Item )
	
	setName ( Object );		
	
EndProcedure

&AtClientAtServerNoContext
Procedure setName ( Object )
	
	Object.FirstName = Title ( Object.FirstName );
	Object.LastName = Title ( Object.LastName );
	Object.Patronymic = Title ( Object.Patronymic );
	name = ContactsForm.FullName ( Object );
	Object.Description = name;
	Object.FullDescription = name;
	
EndProcedure

// *****************************************
// *********** Page ApprovalListPage

&AtClient
Procedure ApprovalListOnStartEdit ( Item, NewRow, Clone )
	
	if ( not NewRow ) then
		return;
	endif; 
	setPriority ( Item.CurrentData );
	
EndProcedure

&AtClient
Procedure setPriority ( Row )
	
	Row.Priority = Row.LineNumber;
	
EndProcedure 

// *****************************************
// *********** Page Properties

&AtClient
Procedure ObjectUsageOnChange ( Item )
	
	Appearance.Apply ( ThisObject, "Object.ObjectUsage" );
	
EndProcedure

&AtClient
Procedure OpenObjectUsage ( Command )
	
	OptionalProperties.Open ( ThisObject, PredefinedValue ( "Enum.PropertiesScope.Item" ), Object.ObjectUsage );
	
EndProcedure

&AtClient
Procedure PropertiesChanged ( Changed, Form ) export
	
	updateProperties ();
	
EndProcedure 

&AtServer
Procedure updateProperties ()
	
	OptionalProperties.Load ( ThisObject );
	
EndProcedure 

&AtClient
Procedure PropertyOnChange ( Item ) export
	
	OptionalProperties.ApplyConditions ( ThisObject, Item );
	OptionalProperties.BuildDescription ( ThisObject );
	OptionalProperties.ChangeHost ( ThisObject, Item );
	
EndProcedure
